{
  "architectures": ["Qwen2ForCausalLM"],
  "hidden_size": 1024,
  "intermediate_size": 2816,
  "max_position_embeddings": 32768,
  "num_attention_heads": 16,
  "num_hidden_layers": 2,
  "num_key_value_heads": 16,
  "vocab_size": 151936,
  "model_type": "qwen2"
}
